Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: Retrieved 2009-11-12..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Chandogya Upanishad" (PDF). Maharishi University of Management website. pp. 151–2. Retrieved 2009-11-12..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Gopal, Madan (1990).
ne: ↑ Griffith, Ralph T.H. (१८९५), "Hymns of the Atharva Veda, Book 8, Hymn 10", The Internet Sacred Text Archive website, अभिगमन मिति २००९-११-१२। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Chandogya Upanishad", Maharishi University of Management website, पृ: 151–2, अभिगमन मिति २००९-११-१२। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Gopal, Madan (1990).

source: Markandeya Purana
ne: मार्कण्डेय पुराण

source: Bhagavata Purana
ne: भागवत पुराण

source: Rescued by Kalantaka-Shiva
ne: शिवद्वारा रक्षा

source: Markandeya (Sanskrit: मार्कण्‍डेय)( IAST: Mārkaṇḍeya) is an ancient rishi (sage) fr Bhrigu Rishi.The Markandeya Purana especially, comprises a dialogue between Markandeya and a sage called Jaimini, and a number of chapters in the Bhagavata Purana are dedicated to his conversations and prayers.[1] He is also mentioned in the Mahabharata. Markandeya is venerated within all mainstream Hindu traditions.
ne: मार्कण्‍डेय एक प्राचीन ऋषि हुन् । उनी अष्ट चिरञ्जीवी मध्ये पनि एक चिरञ्जीवी हुन् । मार्कण्डेय पुराण मार्कण्‍डेय ऋषि र जैमिनी ऋषि बीचको संवाद रहेको छ । श्रीमद्भागवत् पुराणको कयौ अध्याय समेत उनको सम्बाद र प्रथानाले भरिएको छ । [1] महाभारतमा समेत उनको उल्लेख गरिएको पाइन्छ । मार्कण्‍डेयलाई हरेक हिन्दु परम्परा, रीतिरिवाज संस्कृतिमा सम्मानका साथ आदर गरिन्छ ।

source: Today, Markandeya Tirtha, where the sage Markandeya wrote the Markandeya Purana is situated on a trekking route to the Yamunotri Shrine in the Uttarkashi district, Uttarakhand.[2]
ne: आज, मार्कण्‍डेयले मार्कण्‍डेय पुराण रचेको स्थान उत्तरकाशी जिल्ला, उत्तराखण्ड एक पर्यटकीय स्थल बनेको छ ।[2]

source: Shiva protects Markendeya from Yama
ne: मार्कण्‍डेयको रक्षा गर्दै शिव

source: Mrikandu rishi and his wife Marudmati worshipped Shiva and sought from him the boon of begetting a son. As a result, he was given the choice of either a righteous son, but with a short life on earth or a child of low intelligence but with a long life. Mrikandu rishi chose the former, and was blessed with Markandeya, an exemplary son, destined to die at the age of 16.
ne: मृकन्दु ऋषि र उनकी पत्नी मरुद्मतिको कुनै सन्तान थिएनन् र भगवान शिवको कठोर तपस्या गरेर शिवले उनलाई दर्शन दिए । उनले सन्तान प्राप्तिको इच्छा व्यक्त गरेपछि शिवले उनलाई दुई विकल्प दिए , एक तीक्ष्ण बुद्धि भएको , तर छोटो आयु भएको पुत्र र अर्को विकल्प लामो आयु भएको तर मन्दबुद्धि पुत्र मध्ये एक छान्नको लागि भने । मृकन्दु ऋषिले पहिलो विकल्प रोजे र भगवानले उनलाई अनुकरणीय पुत्र मार्कण्‍डेयको बरदान दिए, जसको आयु मात्र १६ वर्षसम्म भनेर भाग्यमा लेखिएको थियो ।

source: Yama then came in person to take away Markandeya's life, and sprung his noose around the young sage's neck. By accident or fate the noose mistakenly landed around the Shivalingam, and out of it, Shiva emerged in all his fury attacking Yama for his act of aggression. After defeating Yama in battle to the point of death, Shiva then revived him, under the condition that the devout youth would live forever.
ne: मार्कण्‍डेय हुर्के बढे पछी भगवान शिवको महान भक्त बने । र उनी आफ्नो आयु सकिने भनिएको दिनमा उनी निरन्तर शिवलिङ्ग शिवको पुजामा तल्लीन भै रहे । आयु सकिएपछी यमराजका दुत यमदुत उनलाई लिन आए । तर उनको शिवको गहिरो भक्ति तथा निरन्तरको प्राथनाले गर्दा उनलाई लैजान सकेनन् । त्यसपछी यमराज स्वयं आफै मार्कण्‍डेयको जीवन उठाउन आए, र आफ्नो फाँसी को फन्दा उनी तर्फ फ्याके । दुर्घटनाले हो वा भाग्यले गर्दा , उनको फन्दा शिवलिंग मा पुग्यो र त्यहाँ बेरियो । शिव आक्रोशित भएर शिवलिङ्गबाट प्रकट भए र यमराजलाई आक्रमण गरे । शिवले यमराजको छातीमा लात मारे । यमराजलाई हराएपछी , शिवले उनलाई चिरञ्जीवी हुने

source: Markandeya prays to Vishnu
ne: विष्णु आराधना गर्दै मार्कण्डेय

source: The Devi Mahatmya section of the Markandeya Purana is one of the most important texts of Shakti tradition.[5]
ne: मार्कण्डेय पुराणको देवी महात्म्य अध्याय शक्ति परम्पराको एक महत्वपूर्ण ग्रन्थ हो[5]

source: Narada Prahlada Four Kumaras Hindu calendar Saptarishi Chiranjivins
ne: नारद प्रह्लाद चार कुमार हिन्दू पञ्चाङ्ग सप्त ऋषि चिरञ्जीवि

source: Speakers
ne: भाषा बोल्ने समुदाय

source: Basic vocabulary
ne: आधारभूत पदावली

source: A New Javanese inscription in Sholihin Mosque, Surakarta.
ne: सोलिहिन मस्जिद, सुराकार्तामा जाभानिज भाषामा लेखिएको शिलालेख।

source: A modern bilingual text in Portuguese and Javanese in Yogyakarta.
ne: योग्याकार्तामा लेखिएको पुर्तगाली र जाभानिज भाषाको शिलापत्र।

source: Distribution map of languages spoken in Java, Madura, and Bali.
ne: जाभा, मदुरा र बालीमा बोलिने जाभानिज भाषा बोल्ने मानिसहरुको बसोबासको एक चित्र।

source: English Ngoko Krama yes iya inggih[32] no ora boten what apa punapa who sapa sinten how kapriyé or kepiyé kados pundi or pripun why nangapa or ngapa kènging punapa eat mangan nedha sleep turu saré here ing kéné ing riki there ing kana ing rika there is (there are) ana wonten there is no (there are no) ora ana boten wonten no! or I don't want it! emoh wegah make a visit for pleasure dolan amèng-amèng
ne: नेपाली Ngoko Krama हो iya inggih[32] होइन ora boten के apa punapa को sapa sinten कसरी kapriyé or kepiyé kados pundi or pripun किन nangapa or ngapa kènging punapa खानु mangan nedha सुत्नु turu saré यहाँ ing kéné ing riki त्यहाँ ing kana ing rika त्यहाँ छ (छन्) ana wonten त्यहाँ छ (छैन) ora ana boten wonten नाईं! अथवा चाहिँदैन! emoh wegah कृपया भ्रमण गर्नुहोस् dolan amèng-amèng

source: Javanese /dʒɑːvəˈniːz/[3] (ꦧꦱꦗꦮ, basa Jawa; Javanese pronunciation: [bɔsɔ dʒɔwɔ]) (colloquially known as ꦕꦫꦗꦮ, cara Jawa; Javanese pronunciation: [tjɔrɔ dʒɔwɔ]) is the language of the Javanese people from the central and eastern parts of the island of Java, in Indonesia. There are also pockets of Javanese speakers in the northern coast of western Java. It is the native language of more than 98 million people[4] (more than 42% of the total population of Indonesia).
ne: जाभानिज भाषा [[W:en:Javanese|Javanese]]/dʒɑːvəˈniːz/[3] जाभानिज उच्चारण बहाषा जाभा [bɔsɔ dʒɔwɔ]) इण्डोनेशियाको जाभा टापुका बासिन्दाले बोल्ने मुख्य भाषा हो। यो भाषा टापूका पूर्वी क्षेत्रमा मूख्यरूपले र मध्य तथा पश्चिमी क्षेत्रमा आंशिक रूपमा बोलिन्छ। यो भाषा बोल्नेको संख्या ९ करोड ९८ लाख भन्दा बढि रहेको तथ्याङ्क छ [4] (जून इण्डोनेशियाको कूल जनसंख्याको ४२ प्रतिशत भन्दा बढी हुन्छ)।

source: Javanese is one of the Austronesian languages, but it is not particularly close to other languages and is difficult to classify. Its closest relatives are the neighbouring languages such as Sundanese, Madurese and Balinese. Most speakers of Javanese also speak Indonesian, the standardized form of Malay spoken in Indonesia, for official and commercial purposes as well as a means to communicate with non-Javanese-speaking Indonesians.
ne: जाभानिज भाषा अष्ट्रो-एशियन भाषा परिवारमा पर्दछ तर यो भाषा अरू भाषा सँग धेरै नजीक नभएकोले यसको बर्गीकरण गर्न कठीन छ। यस भाषाका नजीकका भाषामा छिमेकमा बोलिने सुडानिजऽ मादुरेशी र बालिनिज पर्दछन्। जाभानिज भाषा बोल्ने अधिकांशले इण्डोनेशियन भाषा बोल्दछन्।

source: In Suriname, creolized Javanese is spoken among descendants of plantation migrants brought by the Dutch during the 19th century. In Madura, Bali, Lombok, and the Sunda region of West Java, it is also used as a literary language. It was the court language in Palembang, South Sumatra, until the palace was sacked by the Dutch in the late 18th century.
ne: यो भाषा योग्याकार्टा मध्य तथा पूर्वी जाभा तथा टापूको उत्तरी तटीय भेकमा समेत बोलिन्छ। अन्यत्र बसोबास गर्ने जाभानिज हरूले पनि यो भाषा बोल्दछन्।

source: Javanese is written with the Latin script, Javanese script, and Arabic script.[5] In the present day, the Latin script dominates writings, although the Javanese script is still taught as part of the compulsory Javanese language subject in elementary up to high school levels in Yogyakarta, Central and East Java.
ne: जाभानिज भाषाको आफ्नै जाभानिज लिपी पनि छ तर प्रचलनमा भने ल्याटिन र अरेबिक लिपीको बढी छ। [5] जाभानिज भाषामा ल्याटिन लिपीको प्रयोगले ओगटेपछि हाल प्राथमिक र माध्यमिक विद्यालयमा जाभानिज लिपीको अनिवार्य पठन पाठन सुरू गरिएको छ।

source: Youngest cabinet minister
ne: सबैभन्दा युवा मन्त्रि

source: Government offices Preceded by D. M. Jayaratne Prime Minister of Sri Lanka 2015–2018 Succeeded by Mahinda Rajapaksa Preceded by Ratnasiri Wickremanayake Prime Minister of Sri Lanka 2001–2004 Succeeded by Mahinda Rajapaksa Preceded by Dingiri Banda Wijetunge Prime Minister of Sri Lanka 1993–1994 Succeeded by Chandrika Bandaranaike Kumaratunga
ne: Government offices Preceded by D. M. Jayaratne Prime Minister of Sri Lanka 2015–2018 Succeeded by महिन्दा राजपाक्ष Preceded by Ratnasiri Wickremanayake Prime Minister of Sri Lanka 2001–2004 Succeeded by महिन्दा राजपाक्ष Preceded by Dingiri Banda Wijetunge Prime Minister of Sri Lanka 1993–1994 Succeeded by चन्द्रिका कुमारातुंगा

source: Prime Minister (1993–1994)
ne: प्रधानमन्त्री (१९९३-१९९४)

source: Prime Minister (2015–Present)
ne: प्रधानमन्त्री (२०१५-हाल सम्म)

source: Prime Minister (2001–2004)
ne: प्रधानमन्त्री (२००१-२००४)

source: Early political career
ne: प्रारम्भिक राजनैतिक वृति

source: Following the 2015 Presidential Election's United National Party-led common candidate Maithripala Sirisena having won 51.28% of votes and under Memorandum of Understanding agreement, Wickremesinghe was appointed as prime minister for the 100-day program plan and this is his third term as Prime Minister of Sri Lanka.[51]
ne: २०१५ को राष्ट्रपतीय निर्वाचन पछी , मैत्रिपाला सिरिसेना राष्ट्रपति भए र आपसी समझदारीको सम्झौता अनुसार , विक्रमासिंघे प्रधानमन्त्री नियुक्त भए ।[51]

source: Retrieved 21 August 2015..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Ranil Wickremesinghe – Gentlemen Politician of 4 decades, alias mature leader of the people". United National Party. Archived from the original on 20 July 2015.
ne: Retrieved 21 August 2015..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Ranil Wickremesinghe – Gentlemen Politician of 4 decades, alias mature leader of the people", United National Party, मूलबाट २० जुलाई २०१५-मा सङ्ग्रहित, अभिगमन मिति २१ अगस्ट २०१५। ↑ "Sri Lanka election: shock as president Mahinda Rajapaksa concedes defeat".

source: Retrieved 21 August 2015. ↑ "Sri Lanka election: shock as president Mahinda Rajapaksa concedes defeat".
ne: The Guardian.

source: 9 January 2015. Retrieved 21 August 2015. ↑ Ramachandran, Sudha (13 August 2015).
ne: Retrieved 21 August 2015. ↑ Ramachandran, Sudha (13 August 2015).

source: Retrieved 21 August 2015. ↑ "Regi Siriwardena dies at 82". ancestry.com. Retrieved 21 August 2015. ↑ "Lankalovers". lankalovers.com.
ne: Retrieved 21 August 2015. ↑ "Regi Siriwardena dies at 82", ancestry.com, अभिगमन मिति २१ अगस्ट २०१५। ↑ "Lankalovers". lankalovers.com.

source: Retrieved 21 August 2015. ↑ "Prime Minister Wickremesinghe awarded an honorary doctorate". www.adaderana.lk. ↑ "Sri Lanka: Former Prime Ministers". priu.gov.lk. Archived from the original on 24 September 2015. Retrieved 21 August 2015. ↑ "Ranil Wickremasinghe is scheduled to take oaths as Prime Minister tomorrow | ITN News". www.itnnews.lk.
ne: Retrieved 21 August 2015. ↑ "Prime Minister Wickremesinghe awarded an honorary doctorate". www.adaderana.lk. ↑ "Sri Lanka: Former Prime Ministers", priu.gov.lk, मूलबाट २४ सेप्टेम्बर २०१५-मा सङ्ग्रहित, अभिगमन मिति २१ अगस्ट २०१५। ↑ "Ranil Wickremasinghe is scheduled to take oaths as Prime Minister tomorrow | ITN News", www.itnnews.lk, अभिगमन मिति २०१५-१०-२४। 1 2 3 "BBC News – SOUTH ASIA – Profile: Ranil Wickramasinghe". bbc.co.uk.

source: Retrieved 2015-10-24. 1 2 3 "BBC News – SOUTH ASIA – Profile: Ranil Wickramasinghe". bbc.co.uk. Retrieved 21 August 2015. ↑ Parliamentary General Election 2001, All Island Results Archived 26 August 2010 at Archive.is ↑ Prime Minister sworn in, Dailynews, 10 December 2001 Archived 12 October 2012 at the Wayback Machine. ↑ "The Island on the net". island.lk.
ne: Retrieved 21 August 2015. ↑ Parliamentary General Election 2001, All Island Results Archived 26 August 2010 at Archive.is ↑ Prime Minister sworn in, Dailynews, 10 December 2001 Archived 12 October 2012 at the Wayback Machine. ↑ "The Island on the net". island.lk.

source: Ranil Wickremesinghe, MP (Sinhalese: රනිල් වික්‍රමසිංහ, Tamil: ரணில் விக்ரமசிங்க; born 24 March 1949) is a Sri Lankan politician serving as the Prime Minister of Sri Lanka since 9 January 2015. For his fourth term as the Prime Minister of the United National Party since 1994, and a Member of Parliament for Colombo District since 1977. He is also the leader of the United National Front, having been appointed head of the alliance in October 2009.[1]
ne: रणिल विक्रमासिंघे, MP (Sinhalese: රනිල් වික්‍රමසිංහ, Tamil: ரணில் விக்ரமசிங்க; जन्म : २४ मार्च १९४९) ९ जनवरी १९१५ देखि बहाल रहेका श्रीलंका का प्रधानमन्त्री हुन् । १९९४ मा पहिलो पटक प्रधानमन्त्री बनेका उनी १९७७ देखि प्रतिनीधि सदस्य रहेका थिए । उनी युनाइटेड नेसनल मोर्चाका नेता समेत हुन् र २००९ अक्टोबरमा उनी उक्त गठबन्धनको नेता चयन भएका थिए ।[1]

source: Wickremesinghe also previously served as prime minister from 7 May 1993 to 19 August 1994 and 9 December 2001 to 6 April 2004. He was appointed party leader in November 1994 following the assassination of Gamini Dissanayake during the campaign for the 1994 presidential election.[2] On 8 January 2015, Wickremesinghe was appointed as prime minister by President Maithripala Sirisena, who had defeated President Mahinda Rajapaksa in the 2015 presidential election.[3]
ne: विक्रमासिंघे यस अघि ७ मे १९९३ देखि १९ अगस्ट १९९४ सम्म र ९ डिसेम्बर २००१ देखि ६ अप्रिल २००४ सम्म प्रधानमन्त्रीको रुपमा सेवा गरेका थिए । उनी १९९४ नोबेम्बरमा गमिनी दासनाइके को १९९४ राष्ट्रपति निर्वाचनको दौरान हत्या भए पछि पार्टी नेता छानिएका थिए ।[2] ८ जनवरी २०१५ मा उनी राष्ट्रपति मैत्रीपाला सिरिसेना बाट प्रधानमन्त्री नियुक्त भए जसले २०१५ को राष्ट्रपतीय निर्वाचनमा राष्ट्रपति महिन्दा राजपाक्ष लाई पराजित गारेका थिए ।[3]

source: Wickremesinghe's coalition alliance, the United National Front for Good Governance, won the 2015 parliamentary election with 106 seats. Although it fell short of an outright majority, Wickremesinghe was re-elected as Prime Minister with over 35 Sri Lanka Freedom Party members joining his cabinet.[4][5] Wickremesinghe was relieved of his duties as Prime Minister effective immediately on 26 October 2018 by President Maithripala Sirisena with the appointment of former President Mahinda Rajapaksa as the Prime Minister of Sri Lanka, which Wickremesinghe has claimed unconstitutional and refused to accept, resulting in a constitutional crisis.
ne: विक्रमासिंघे को गठबन्धन, सुशासन को लागि युनाइटेड नेसनल मोर्चा , ले २०१५ को संसदीय निर्वाचनमा १०६ सिट मा जीत हासिल गरेको थियो । यो बहुमतको लागि अपर्याप्त भए पनि श्रीलंका फ्रिडम पार्टीका ३५ सदस्यले समर्थन गरे पछी उनी प्रधानमन्त्री निर्वाचित भएका थिए ।[4][5] २६ अक्टोबर २०१८ मा राष्ट्रपति मैत्रीपाला सिरिसेनाले विक्रमासिंघेको सरकार भंग गरि पूर्व राष्ट्रपति महिन्दा राजापाक्षेलाई प्रधानमन्त्री नियुक्त गरे। http://www.mysansar.com/2018/10/33715/Wickremesingयाले गर्दा श्रीलंकामा संबैधानिक संकट सिर्जना भयो ।
